{"url": "https://www.bbc.com/", "content": {"url": "https://www.bbc.com/", "title": "BBC Home - Breaking News, World News, US News, Sports, Business, Innovation, Climate, Culture, Travel, Video &amp; Audio", "text": "BBC Home - Breaking News, World News, US News, Sports, Business, Innovation, Climate, Culture, Travel, Video &amp; Audio Skip to content British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US &amp; Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science &amp; Health Artificial Intelligence AI v the Mind Culture Film &amp; TV Music Art &amp; Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean &amp; Bermuda Central America Europe Middle East North America South America World’s Table Culture &amp; Experiences Adventures The SpeciaList Earth Natural Wonders Weather &amp; Science Climate Solutions Sustainable Business Green Living Audio Podcasts Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Prince Harry &#x27;can&#x27;t see a world&#x27; where his family will visit the UK The Duke of Sussex says the downgrading of taxpayer-funded protection makes visiting the UK too risky. 23 mins ago UK LIVE Canada&#x27;s Carney says he will meet Donald Trump next week Prime Minister Mark Carney says at a news conference that King Charles III will deliver a throne speech in Canada&#x27;s Parliament on 27 May. Prince Harry &#x27;can&#x27;t see a world&#x27; where his family will visit the UK The Duke of Sussex says the downgrading of taxpayer-funded protection makes visiting the UK too risky. 23 mins ago UK LIVE Canada&#x27;s Carney says he will meet Donald Trump next week Prime Minister Mark Carney says at a news conference that King Charles III will deliver a throne speech in Canada&#x27;s Parliament on 27 May. Prince Harry tells BBC he wants &#x27;reconciliation&#x27; with Royal Family In an exclusive interview in California, the prince says that his father is not speaking to him over his security legal challenge. 13 mins ago UK Evacuations in Chile and Argentina after tsunami warning A 7.4 magnitude earthquake struck off of Chile&#x27;s southern coast on Friday morning. 12 mins ago Latin America Activists say ship aiming to sail to Gaza was attacked by drones The incident happened off the coast of Malta. The government said a fire onboard the ship was &quot;brought under control overnight&quot;. 4 hrs ago Middle East Groundbreaking musician Jill Sobule dies in house fire Her song I Kissed a Girl is widely considered the first openly gay themed song to crack the Billboard Top 20. 13 hrs ago Culture AfD classified as extreme-right by German intelligence The AfD came second in Germany&#x27;s February elections and has a record number of seats in the new parliament. 4 hrs ago Europe Only from the BBC 12 of the best films to watch this May From Thunderbolts* to Mission: Impossible - The Final Reckoning, these are the films to stream at home and watch at this cinema this month. 7 hrs ago Culture Are heated tobacco products a new health risk? A new type of tobacco product has seen rising use around the world, but there are still serious questions about how it affects human health. 4 hrs ago Future Ship carrying aid for Gaza bombed by drones In a recording of a distress call sent to the BBC, the captain is heard amid explosions 28 mins Save More news South African woman guilty of kidnapping and trafficking daughter aged 6 33 mins ago Africa LIVE Nigel Farage&#x27;s Reform UK takes first councils after by-election and mayoral wins Israel says it struck near Syria palace over violence in Druze areas 32 mins ago Middle East Trump signs order to block funding to public radio 1 hr ago Culture Temu to stop selling goods from China directly to US customers 3 hrs ago Business Must watch Russell Brand&#x27;s court appearance explained... in 50 seconds The BBC&#x27;s Charlotte Gallagher reports from outside Westminster Magistrates&#x27; Court in London, as Brand faces multiple charges. 4 hrs ago Just how dangerous is space debris? In the past decade, the dramatic surge in satellite launches has left space cluttered with junk. 6 hrs ago Weather &amp; science Reform UK&#x27;s by-election win raises questions for Labour and Tories Damian Grammaticas reports from the Runcorn and Helsby by-election count after a knife-edge victory for Reform. 8 hrs ago &#x27;Well there you go&#x27;: Watch moment spokeswoman learns Waltz news Tammy Bruce found out about Mike Waltz&#x27;s job change from a reporter during a news briefing on Thursday. 20 hrs ago US &amp; Canada Five things to know before Miami Grand Prix BBC Sport&#x27;s Harry Benjamin looks ahead to the Miami Grand Prix and the five things to look out for over the race weekend. 11 hrs ago Sport What&#x27;s in the US-Ukraine resources deal? The BBC&#x27;s analysis editor looks at what has been agreed in the much-anticipated agreement. 23 hrs ago World If you were Australia PM, how would you handle the US and China? Ahead of Australia&#x27;s election, the BBC asked voters about the increasingly fraught US-China relationship. 1 day ago World &#x27;He&#x27;s quite fussy!&#x27; - meet the craftsman who makes O&#x27;Sullivan&#x27;s cues World-renowned master cue craftsman John Parris tells BBC Sport&#x27;s Daniel Austin about producing cues for top snooker players such as Ronnie O&#x27;Sullivan. 6 hrs ago Snooker Travel London&#x27;s newest hip area isn&#x27;t where you think A few miles from East London&#x27;s perennially hip neighbourhoods, an explosion of art and culture is transforming a once-neglected stretch into one of the city&#x27;s hottest destinations. See more Football In pictures: Beckham at 50 As David Beckham celebrates his 50th birthday, BBC Sport looks back at his life in photos. See more US &amp; Canada news Canada election: One in six seats changed hands Seat swaps more than doubled compared to the last election, and all 59 seats that flipped went to the Liberals or the Conservatives. 5 mins ago US &amp; Canada How Canada voted - in charts 1 hr ago US &amp; Canada Trump to rename Veterans Day and VE Day to honor World Wars 2 hrs ago US &amp; Canada Trump disliked Trudeau - why Carney may fare better 7 hrs ago US &amp; Canada More world news Anger as Uganda president&#x27;s son says he&#x27;s holding opposition bodyguard The bodyguard of opposition leader Bobi Wine went missing five days ago, leading to fears for his safety. Just now Africa What&#x27;s the fighting in DR Congo all about? 7 mins ago Africa &#x27;I was born Ivorian&#x27; - bank boss barred from running for president tells BBC 16 mins ago Africa Tanzanian priest - and government critic - brutally attacked 30 mins ago Africa Sport LIVE Miami GP: Verstappen set for practice session after birth of first child Listen to live radio commentary and follow text updates from practice before sprint qualifying at the Miami Grand Prix. &#x27;Runs the currency&#x27; as batting decision looms 1 hr ago England Jorginho might return this season after lung injury 1 hr ago Arsenal &#x27;You start to think if it&#x27;s going to be your time&#x27; 1 hr ago Golf Business US jobs grow by more than expected despite tariff turmoil Employers added 177,000 roles in April as the jobs market continues to prove resilient. 3 hrs ago Business Meta threatens to cut off Facebook in Nigeria over huge fines 3 hrs ago Africa Talks or no talks: Who blinks first in US-China trade war? 16 hrs ago World Apple says most US-bound iPhones no longer made in China 10 hrs ago Business Latest audio F1: Chequered Flag Miami Grand Prix preview Save Football Daily The Commentators’ View: Bowls drama, stanchions &amp; worldies Save Americast Is Donald Trump losing public support? Save World Business Report US jobs figure beats expectations Save The Documentary Podcast Heart and Soul: After Francis, what do Catholics want next? Save Business Daily Business Daily meets: US healthcare CEO Judy Faulkner Save Football Daily Euro Leagues: The next Messi, the genius of Lamine Yamal and Mr Trousers Save World Business Report A deal on Ukraine minerals: but what’s in the small print? Save Tech Grand Theft Auto 6 delayed until May 2026 It&#x27;s the news no-one wanted to hear - Grand Theft Auto 6&#x27;s release date has been pushed back to next year. 2 hrs ago Newsbeat Co-op gives away free pasta sauce and coffee by mistake 4 hrs ago Technology Why Australia&#x27;s opposition is vying for votes on Chinese social media 17 hrs ago World Harrods latest UK retailer to be hit by cyber attack 21 hrs ago Technology Science &amp; health RFK Jr plans placebo-trial testing for &#x27;all new vaccines&#x27; Experts are alarmed by plans to require placebo testing for already approved shots like the covid vaccine. 19 hrs ago Health Can this lynx born in a zoo learn to live in the wild? 6 hrs ago Science &amp; Environment Two Gazan girls first to arrive in UK for medical treatment 6 hrs ago Middle East Second daily endometriosis pill approved for NHS 1 day ago Health Culture Prince Harry loses legal challenge over security The Duke of Sussex launched a challenge in the Court of Appeal over a dispute with the government about his security. 2 hrs ago UK Russell Brand granted bail after court appearance 6 hrs ago Culture Diddy rejects plea deal in sex trafficking trial 6 hrs ago Culture Princess Charlotte photo released to mark 10th birthday 5 hrs ago UK Arts The overlooked masterpiece full of coded messages about WW1 Esoteric and pioneering, the paintings of a lesser-known Pre-Raphaelite, Evelyn De Morgan, explored the trauma and meaning of war – and prefigured current fantasy art. 24 Apr 2025 Culture David Bowie to Doctor Who: Famous faces come to life in art show 17 hrs ago Culture The gory Shakespeare play that makes people faint 23 Apr 2025 Culture Why this iconic 1839 painting is not what it seems 17 Apr 2025 Culture Watch How your &#x27;second brain&#x27; changes the way you think The connection between our brain and gut has a profound effect on our wellbeing. We look at ways to improve it. See more Travel The secrets of feeding the papal conclave For more than 750 years, strict rules have guarded what cardinals can and cannot eat to prevent hidden messages stuffed inside chicken, ravioli and napkins. 1 day ago Travel A Hollywood director&#x27;s top cocktail bars around the world 2 days ago Travel How a smiling animal put an island on the map 3 days ago Travel The European nation where bears are booming 4 days ago Travel World&#x27;s Table Eight Asian sauces to keep in your pantry From Korea&#x27;s doenjang and gochujang to Hong Kong&#x27;s XO sauce and East Asia&#x27;s fish sauce, Asian cuisines provide hundreds of ways to flavour and season dishes. 24 Apr 2025 Travel The recipe for a centuries-old Easter baba made with 96 eggs 19 Apr 2025 Travel The baffling purple honey only found in the US South 18 Apr 2025 Travel Thailand&#x27;s cooling rice dish to beat the heat 14 Apr 2025 Travel Earth How a burning river lit the US&#x27;s green movement The Cuyahoga River was so polluted it regularly went up in flames. Images of one dramatic blaze in 1952 shaped the US&#x27;s nascent environmental movement, long after the flames went out. 1 day ago Future Liverpool fans&#x27; celebrations caused earth tremor 3 hrs ago Liverpool Why the trees behind shea butter beauty cream are under threat 1 day ago Africa Mosquitoes in Scotland as far north as Shetland 1 day ago NE, Orkney &amp; Shetland Video From Ptolemy to Nasa: Seven historic Earth images Watch how the maps and images of our planet from above have changed over the last two millennia. 2 days ago Earth Lemur mum has ingenious idea to save newborn from ticks 3 days ago Natural wonders Uncovering a hangar full of rare historic campervans 4 days ago The Travel Show Lilly Sabri talks after two-year silence on social media 7 days ago World of Business Discover more from the BBC Tech Decoded Get timely, trusted tech news from BBC correspondents around the world, every Monday and Friday. Download the BBC app Click here to download the BBC app for Apple and Android devices. US Politics Unspun No noise. No agenda. Just expert analysis of the issues that matter most from Anthony Zurcher, every Wednesday. Register for a BBC account Don&#x27;t have time to read everything right now? Your BBC account lets you save articles and videos for later. Subscribe to the Essential List The week’s best stories, handpicked by BBC editors, in your inbox every Tuesday and Friday. Sign up to News Briefing News and expert analysis for every schedule. Get the morning and evening editions of our flagship newsletter in your inbox. British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather BBC Shop BritBox BBC in other languages Follow BBC on: Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Contact the BBC Advertise with us Do not share or sell my info Contact technical support Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "timestamp": "2025-05-02T16:31:08.341538"}, "timestamp": "2025-05-02T19:31:08.452054", "request_id": "544bb992-c085-4143-9007-4385e6540c43"}